<a href="https://colab.research.google.com/github/Santgupt/Test-Projects/blob/master/Project_TitanicTrain.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanictrain.csv")

In [3]:
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [4]:
df=df.drop(["PassengerId",'Name',"Ticket","Embarked",'Cabin'],axis=1)

In [5]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [6]:
X=df.drop("Survived",axis=1)

In [7]:
y=df["Survived"]

In [8]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     714 non-null    float64
 3   SibSp   891 non-null    int64
 4   Parch   891 non-null    int64
 5   Fare    891 non-null    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 41.9+ KB

In [9]:
X=pd.get_dummies(df,columns=["Sex"])

In [10]:
X.dtypes

Survived        int64
Pclass          int64
Age           float64
SibSp           int64
Parch           int64
Fare          float64
Sex_female      uint8
Sex_male        uint8
dtype: object

In [11]:
type(X)

pandas.core.frame.DataFrame

In [12]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    891 non-null    int64
 1   Pclass      891 non-null    int64
 2   Age         714 non-null    float64
 3   SibSp       891 non-null    int64
 4   Parch       891 non-null    int64
 5   Fare        891 non-null    float64
 6   Sex_female  891 non-null    uint8
 7   Sex_male    891 non-null    uint8
dtypes: float64(2), int64(4), uint8(2)
memory usage: 43.6 KB

In [13]:
X.fillna(df["Age"].mean(),inplace=True)

In [14]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    891 non-null    int64
 1   Pclass      891 non-null    int64
 2   Age         891 non-null    float64
 3   SibSp       891 non-null    int64
 4   Parch       891 non-null    int64
 5   Fare        891 non-null    float64
 6   Sex_female  891 non-null    uint8
 7   Sex_male    891 non-null    uint8
dtypes: float64(2), int64(4), uint8(2)
memory usage: 43.6 KB

In [15]:
X.shape

(891, 8)

In [16]:
X

     Survived  Pclass        Age  SibSp  Parch     Fare  Sex_female  Sex_male
0           0       3  22.000000      1      0   7.2500           0         1
1           1       1  38.000000      1      0  71.2833           1         0
2           1       3  26.000000      0      0   7.9250           1         0
3           1       1  35.000000      1      0  53.1000           1         0
4           0       3  35.000000      0      0   8.0500           0         1
..        ...     ...        ...    ...    ...      ...         ...       ...
886         0       2  27.000000      0      0  13.0000           0         1
887         1       1  19.000000      0      0  30.0000           1         0
888         0       3  29.699118      1      2  23.4500           1         0
889         1       1  26.000000      0      0  30.0000           0         1
890         0       3  32.000000      0      0   7.7500           0         1

[891 rows x 8 columns]

In [17]:
from sklearn.model_selection import train_test_split

In [18]:
X_train,X_test,y_train,y_test=train_test_split(X,y,stratify=y,random_state=42)

In [19]:
from sklearn.tree import DecisionTreeClassifier

In [20]:
tree=DecisionTreeClassifier(max_depth=1)

In [21]:
tree.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=1, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [22]:
tree.score(X_test,y_test)

1.0